{
    "translation": {
        "homemenu": "Inicio",
        "aboutmenu": "Sobre",
        "skillsmenu": "Habilidades",
        "projectsmenu": "Projetos",
        "experiencemenu": "Experiencia",
        "idiomamenu": "Idioma",
        "herotitle": "Desenvolvedor",
        "herosub": "Das ideias às soluções eficazes. Juntos, vamos criar algo excepcional. Entre em contato e vamos começar.",
        "abouttitle": "Sobre mim",
        "aboutsub": "Desenvolvedor backend especializado em Python. Minha experiência abrange desenvolvimento web com Django, criação de aplicações desktop utilizando Tkinter, CustomTkinter e Flet, além de projetos Python envolvendo Deep Learning e integrações com IA. Tenho paixão por encontrar soluções inovadoras para desafios complexos e procuro constantemente expandir meus conhecimentos e habilidades",
        "skillstitle": "Habilidades e Linguagens",
        "titlepython": "Python",
        "python": "Possuo habilidades sólidas em Python, utilizando-o como minha principal linguagem de programação. Com experiência em uma variedade de projetos, desde desenvolvimento web com Django até tarefas de automação e análise de dados, sou capaz de desenvolver soluções eficazes em Python.",
        "titledjango": "Desenvolvimento Web (Django)",
        "django": "Demonstro competência em desenvolvimento web, com foco no framework Django. Consigo criar aplicações web funcionais, implementando recursos como APIs RESTful e sistemas de autenticação de forma eficiente.",
        "titledesktop": "Aplicações desktop",
        "desktop": "Tenho experiência na criação de aplicações desktop utilizando Tkinter, CustomTkinter e Flet. Sou capaz de desenvolver interfaces de usuário simples e funcionais para aplicações desktop, integrando diversas funcionalidades conforme necessário.",
        "deeplearning": "Possuo conhecimentos em Deep Learning, incluindo o desenvolvimento e treinamento de modelos de Machine Learning e análise de dados. Utilizo essas habilidades para explorar e implementar soluções que envolvem aprendizado de máquina em diferentes contextos.",
        "titleintegracao": "Integrações com AI",
        "integracaoai": "Tenho experiência em integrar soluções de Inteligência Artificial em projetos variados. Sou capaz de implementar e adaptar algoritmos de IA para adicionar funcionalidades avançadas aos sistemas desenvolvidos.",
        "frontend": "Além das habilidades em backend, possuo conhecimentos em frontend, com ênfase na utilização da biblioteca Tailwind CSS. Consigo criar interfaces de usuário simples e responsivas, seguindo as melhores práticas de design web.",
        "project": "projetos",
        "inician": "Iniciante",
        "calc": "Calculadora",
        "subcalc": "Desenvolvi uma calculadora simples em Python com Tkinter. Organizei os botões em uma grade para facilitar a interação com o usuário, permitindo que cálculos básicos sejam feitos de forma intuitiva.",
        "calcage": "Calculadora de Idade",
        "subcalcage": "Desenvolvi uma calculadora de idade em Python usando Tkinter. Permite que o usuário calcule a idade com base em uma data de início e uma data de nascimento. É uma ferramenta útil para calcular idades de forma rápida e intuitiva.",
        "interm": "Intermediário",
        "spotify": "Spotify Downloader",
        "subspotify": "Criei um downloader para Spotify usando Python e o framework Flet. Com este aplicativo, você pode baixar músicas individuais e listas de reprodução inteiras com facilidade. Integrei a biblioteca SpotDL para garantir uma experiência eficiente e completa.",
        "player": "PyPlayer: Reprodutor de Música",
        "subplayer": "Desenvolvi o PyPlayer, um reprodutor de música simples usando Python. Com ele, você pode reproduzir suas músicas favoritas facilmente e de forma eficiente. Usei Tkinter para a interface gráfica e Pygame para o controle de áudio, garantindo uma experiência fluída e agradável.",
        "ytdownloader": "Youtube Downloader",
        "subytdownloader": "Desenvolvi um downloader para YouTube que permite baixar vídeos e músicas facilmente. Usei Python, CustomTkinter e Pytube para criar este aplicativo, garantindo compatibilidade com vários formatos de áudio e vídeo.",
        "cadastroflet": "Sistema de Cadastro de Clientes",
        "subcadastroflet": "Desenvolvi um sistema em Python para praticar conexão com banco de dados, utilizando a biblioteca Flet para criar uma interface gráfica interativa. O sistema permite adicionar novos clientes com seus respectivos nomes e idades, exibindo uma lista dos clientes cadastrados em tempo real. Esta solução é útil para aprendizado de integração com banco de dados e desenvolvimento de interfaces gráficas.",
        "flashcard": "Aplicativo Web de Flashcards de Estudo",
        "subflashcard": "Desenvolvi uma aplicação web usando Django para ajudar em estudos individuais com cartões de estudo. Os usuários podem criar desafios e anexar materiais de estudo. É uma ferramenta útil para revisão e aprendizado personalizado.",
        "avanced": "Avançado",
        "countfinger": "Detector de Dedos em Tempo Real",
        "subcountfinger": "Desenvolvi um aplicativo que utiliza visão computacional para detectar e contar dedos em tempo real. Usei Python e a biblioteca MediaPipe para criar esta solução avançada, que pode ser utilizada em uma variedade de aplicações interativas.",
        "facerec": "Comparador de Rostos",
        "subfacerec": "Desenvolvi um aplicativo em Python que utiliza a biblioteca face_recognition para identificar e comparar faces em imagens. Exibe os resultados da comparação e destaca as regiões faciais em ambas as imagens. É uma ferramenta útil para diversas aplicações, como segurança e análise forense.",
        "voiceass": "Assistente de Voz com Gemini AI",
        "subvoiceass": "Desenvolvi um assistente de voz usando a tecnologia Gemini AI. Este aplicativo permite interações por voz para realizar tarefas como chat e reconhecimento de fala em tempo real. Explorei o poder da inteligência artificial para criar uma solução avançada e inovadora.",
        "facedetect": "Detector de Faces em Tempo Real",
        "subfacedetect": "Desenvolvi um aplicativo em Python que utiliza a biblioteca MediaPipe para detectar e destacar faces em tempo real a partir da webcam. Fornece uma experiência interativa de reconhecimento facial e é útil para diversas aplicações, como filtragem de imagem e interações em tempo real.",
        "contentai": "Gerador de Conteúdo com Gemini AI",
        "subcontentai": "Desenvolvi um código em Python que demonstra o uso da API Gemini AI para gerar conteúdo de forma automatizada. Explora a capacidade da API de produzir respostas informativas e criativas para uma variedade de consultas. Esta solução é valiosa para criar chatbots, assistentes virtuais e outras aplicações de geração de conteúdo automatizado.",
        "titledsistem": "Sistema Integrado de Vendas",
        "subweb": "Desenvolvi um sistema de gerenciamento de vendas personalizado para a Jsantos Eletrônicos. Além de recursos padrão, como registro detalhado de clientes e exportação de relatórios em PDF e CSV, implementei funcionalidades avançadas, como autenticação segura com Allauth Google e envio de e-mails personalizados. Este projeto destaca-se pela sua capacidade de simplificar e aprimorar a gestão de vendas da loja, oferecendo uma solução eficiente e adaptada às necessidades específicas do cliente.",
        "titlesharepin": "Share Pin: Organize Links e Notas",
        "subsharepin": "Como parte de um projeto de desenvolvimento web em Flask, eu, em colaboração com o 'Matheus Gama', contribuí com o desenvolvimento do frontend, utilizando Tailwind CSS para aprimorar a interface do usuário, garantindo responsividade e uma experiência moderna. Enquanto o 'Matheus Gama' liderou o desenvolvimento do backend, que inclui recursos como autenticação de usuários, manipulação de pins (adicionar, editar, excluir), criação de listas de pins e implementação de um sistema de envio de e-mails para confirmação de contas e atualizações de senha."
    }
}